<?php
ini_set('error_reporting', E_ALL);
ini_set('display_errors', E_ALL);

//date_default_timezone_set("Europe/Kiev");

// Start session
@session_start();

$config = array();

// General
$config['web_path'] = '/survey';

// SMTP
$config['smtp']['server_host'] = 'smtp.freenet.com.ua';
$config['smtp']['server_port'] = '25';
$config['smtp']['server_user'] = '';
$config['smtp']['server_pass'] = '';
$config['smtp']['email_address'] = 'email_to';
$config['smtp']['email_subject'] = 'ІВІР Опитування';

// Vote
$qa['question'] = '1. Які цілі в грі Ви переслідуєте?';
$qa['answers'] = array('Взаємодію між людьми та спілкування', 'Просто витрачаю вільний час', 'Хочу відобразити своє значення в суспільстві', 'Хочу стати відомим гравцем', 'Думаю заробляти ігрову валюту та продавати за реальні гроші');
$qa['type'] = 'checkbox';
$qas[] = $qa;

$qa['question'] = '2. Яке значення для Вас має мораль та культура в грі?';
$qa['answers'] = array('Ніяке. Це лише гра', 'Лише гра, одна хотілось би приділяти більше уваги моралі та культурі', 'Велике значення, мораль повсюду, а гра - це лише сфера взаємодії між людьми');
$qa['type'] = 'checkbox';
$qas[] = $qa;

$qa['question'] = '3. Яке значення для Вас має "служіння благу"?';
$qa['answers'] = array('Ніяке. Благородство в наш час застаріло, його ніхто не цінить', 'Для мене це потреба душі, умова власного щастя', 'Роблю добро, коли маю можливість. Але не стану ризикувати собою ради тих, кого не знаю');
$qa['type'] = 'checkbox';
$qas[] = $qa;

$qa['question'] = '4. Для Вас багатство - це ';
$qa['answers'] = array('Можливість отримувати все, чого бажаєш', 'Для кожного своє, можна бути багатим, нічого не маючи', 'Визнання серед інших', 'Відчуття власної важливості',);
$qa['type'] = 'checkbox';
$qas[] = $qa;

$qa['question'] = '5. Для Вас війна - це';
$qa['answers'] = array('Самий простий спосіб вирішення проблеми', 'Неминучі речі ігрового життя, це те, ради чого ми всі граємо', 'Всього лише боязка втеча від проблем мирного часу', 'Можливість керувати групою людей',);
$qa['type'] = 'checkbox';
$qas[] = $qa;

$qa['question'] = '6. Для Вас добро - це';
$qa['answers'] = array('Зробивши щось добре, це можливість безкарно творити зло', 'Можливість керування людьми', 'Активне використання здібностей душі людини відповідно до високої гідності або чесноти', 'Речі, яких не вистачає в нашому сучасному світі',);
$qa['type'] = 'checkbox';
$qas[] = $qa;

$qa['question'] = '7. Що ви зробите, якщо побачите результат несправедливості або ж причину, яка може стати результатом несправедливості?';
$qa['answers'] = array('Якщо це мене не стосується, не втручатимуся в чужі справи, оскільки я не знаю всіх фактів і причин конфлікту', 'Намагатимусь запобігти скоєнню несправедливості');
$qa['type'] = 'checkbox';
$qas[] = $qa;

$qa['question'] = '8. Якщо вас хтось як-небудь обдурив або підставив і Ви вирішите помститися, чи підете ви на обман і зраду?';
$qa['answers'] = array('Залежно від моїх втрат через те, що мене зрадили або обдурили', 'Мститиму, поки не поверну те, що мені належить', 'Ні, не піду. Кращий спосіб помститися, це довести, що матеріальні втрати для мене нічого не означають', 'Мовчки зроблю висновки і більше не матиму справ з такою людиною',);
$qa['type'] = 'checkbox';
$qas[] = $qa;

$qa['question'] = '9. По якому шляху Ви підете в своєму розвитку в грі?';
$qa['answers'] = array('Шукатиму сильних союзників. Сила і єдність – запорука успіху', 'Шукатиму суспільство, яке відповідає моїм особистим принципам і інтересам', 'Шукатиму суспільство, що цінує мораль і культуру', 'Шукатиму суспільство, в якому буде найлегше досягти бажаних цілей',);
$qa['type'] = 'checkbox';
$qas[] = $qa;

$config['vote'] = $qas;
